---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ParameterFailures
source: html/14425993-8140-fe6c-3e82-54e8ed6c9fe2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ParameterFailures

Failures related to parameters and parameter operations.

## Syntax (C#)
```csharp
public static class ParameterFailures
```